app/controllers/comments_controller.rb

	def create
		@comment = @lecture.comments.create(params[:comment].permit(:content))
		@comment.user_id = current_user.id
		@comment.save
---
INSERT INTO "comments" ("content", "lecture_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "sdsdsdsds"], ["lecture_id", 6], ["created_at", "2017-05-15 13:59:41.200319"], ["updated_at", "2017-05-15 13:59:41.200319"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 3], ["updated_at", "2017-05-15 13:59:41.249157"], ["id", 1]]

	def update
		if @comment.update(params[:comment].permit(:content))
---
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "Welcome nahla"], ["updated_at", "2017-05-15 15:33:38.151809"], ["id", 4]]

		def find_lecture
			@lecture = Lecture.find(params[:lecture_id])
---
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 6]]

		def find_comment
			@comment = @lecture.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."lecture_id" = ? AND "comments"."id" = ? LIMIT 1  [["lecture_id", 6], ["id", 4]]