app/controllers/courses_controller.rb

INSERT INTO "courses" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "java"], ["user_id", 0], ["created_at", "2017-05-13 18:24:09.386739"], ["updated_at", "2017-05-13 18:24:09.386739"]]
---
  def create
    @course = Course.new(course_params)
    @course.user_id = current_user.id
    respond_to do |format|
      if @course.save

UPDATE "courses" SET "title" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["title", "nodejssss"], ["updated_at", "2017-05-14 15:31:14.671918"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)