app/controllers/lectures_controller.rb

SELECT "lectures".* FROM "lectures"
---
  def index
    @lectures = Lecture.all

SELECT "comments".* FROM "comments" WHERE "comments"."lecture_id" = 6  ORDER BY created_at DESC
---
  def show
    @comments=Comment.where(lecture_id: @lecture).order("created_at ASC")

INSERT INTO "lectures" ("content", "attachment", "course_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "<p>lorum Ipsum</p>\r\n"], ["attachment", ""], ["course_id", 2], ["user_id", 0], ["created_at", "2017-05-13 18:27:31.293471"], ["updated_at", "2017-05-13 18:27:31.293471"]]
---
  def create
    @lecture = Lecture.new(lecture_params)
    @lecture.user_id = current_user.id
    respond_to do |format|
      if @lecture.save

UPDATE "lectures" SET "content" = ?, "updated_at" = ? WHERE "lectures"."id" = ?  [["content", "<p><span style=\"color:#2ecc71;\">hhh</span>lorum Ipsum</p>\r\n"], ["updated_at", "2017-05-13 18:27:52.849970"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @lecture.update(lecture_params)

SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = ?  [["user_id", 2]]
---
  def load_courses
    @courses=Course.where(user_id: current_user.try(:id))

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 6]]
---
  def upvote
    @lecture = Lecture.find(params[:id])

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 6]]
---
  def downvote
    @lecture = Lecture.find(params[:id])

SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 9]]
---
    def set_lecture
      @lecture = Lecture.find(params[:id])